---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPSection.Friction
source: html/22ced217-3118-4027-51ff-2b3d975a1bbb.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSection.Friction Property

The friction of the section.

## Syntax (C#)
```csharp
public double Friction { get; }
```

## Remarks
In one section, all section members have same friction.
 Default unit is Feet of Water (60 °F) per 100 feet.
 For Duct, unit type is UT_HVAC_Friction.
 For Pipe, unit type is UT_Piping_Friction